columns_names = {
    "maintenances": [
         "UID", "Дата", "Текущее состояние", "Сотрудник (UID)", "Деталь кузова (UID)", "Деталь ходовой части (UID)",
         "Деталь ударно-тягового устройства (UID)", "Деталь тормозного оборудования (UID)", "Вагон (UID)"
    ],

    "station_employees": [
        "Номер договора о трудоустройстве", "ФИО", "Контактные данные"
    ],

    "railroad_cars": [
        "Серийный номер", "Тип вагона", "Тип неисправности"
    ],

    "body_parts": [
        "Серийный номер", "Наименование детали", "Код изготовителя", "Дата производства", "Количество"]
    ,

    "chassis_parts": [
        "Серийный номер", "Наименование детали", "Код изготовителя", "Дата производства", "Количество"
    ],

    "shock_traction_device_parts": [
        "Серийный номер", "Наименование детали", "Код изготовителя", "Дата производства", "Количество"
    ],

    "braking_equipment_parts": [
        "Серийный номер", "Наименование детали", "Код изготовителя", "Дата производства", "Количество"
    ]
}

texts = [
    "Техническое обслуживание", "Сотрудники станции", "Вагоны",
    "Детали кузова", "Детали ходовой части", "Детали ударно-тягового устройства",
    "Детали тормозного оборудования"
]

window_name = {
    "maintenances": "Техническое обслуживание",
    "station_employees": "Сотрудники станции",
    "railroad_cars" : "Вагоны",
    "body_parts": "Детали кузова",
    "chassis_parts": "Детали ходовой части",
    "shock_traction_device_parts": "Детали ударно-тягового устройства",
    "braking_equipment_parts": "Детали тормозного оборудования"
}

datatypes = {
    "id": int,
    "date": str,
    "name": str,
    "status": str
}